---
type: TaskDialogShowingEventArgs
namespace: Autodesk.Revit.UI.Events
version: 2024
members: 1
tags: [revit-api, class]
---

# TaskDialogShowingEventArgs

`Autodesk.Revit.UI.Events.TaskDialogShowingEventArgs` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Message | 2010 | `public string Message { get ; }` |